---
layout: post
title: 眼镜行业用户画像(Personas)如何做
subtitle: How design personas for eyeglass industry
date: 2016-09-17
categories: blog
tags: [UX,eglass,glasses]
description: eGlass在试戴系统的知识预备
catalog: true
type: article
---

# 为什么需要用户画像（Personas）

一个产品创意初期对用户的需求定义，在产品原型产出后，有时候会推倒重来。
为什么对用户理解遗失？用户是多样的，在设计初期没有对用户进行定义，闭门造车中，设计师很容易忘记用户雏形。因此，在设计初期需要用户画像来帮助设计师理解用户，用户画像在整个产品过程中具有指导作用。

用户画像的核心工作是为用户打标签，打标签的重要目的之一是为了让人能够理解并且方便计算机处理，如，可以做分类统计：脸型是什么？年龄多大？喜欢什么类型的眼镜？男女比例多岁？ 

也可以做数据挖掘工作：利用关联规则计算，什么样的脸型会适合什么样形状的镜框？利用聚类算法分析，喜欢黑色板材的人年龄分布情况？

大数据处理，离不开计算机的运算，标签提供了一种便捷的方式，使得计算机能够程序化处理与人相关的信息，甚至通过算法、模型能够“理解” 人。当计算机具备这样的能力后，就可以知道供应商了解市场情况，精确投放产品，也可以帮助零售店将店内空间利用率提高，剔除陈货老货。

# 如何设计用户画像？

早期Pruitt和Adlan的人物角色周期概念

- 计划：创建角色前的研究和计划阶段

- 构思与孕育：将研究数据和观察转换成角色

- 诞生与成熟：强有力／清晰地表达

- 成年：在设计流程中发挥作用

- 终生成就与退休：评估角色地作用

Alan Cooper 在1990年提出了「Pernonas - 人物画像」的概念，一种新兴的以用户为中心的设计方法。根据他的定义，Personas 是一种虚拟的(Frictious)，带有细节的(Specific)和具象的(Concrete)的目标用户的形象代表[1]。要达到这样的一种画像，就需要研究人员在使用该产品时的使用场景(Scenario)以及交互细节及原因。

# 群体定量统计分析

做用户画像的基础，是通过数据对海量用户有一个初步的了解，一般采用用户数据提取分析与问卷调研两种方式进行，根据产品目标确定统计分析的维度指标。

分析的维度，可以按照人口属性和产品行为属性进行综合分析：

- *人口属性（静态信息）*：地域、年龄、性别、文化、职业、收入、生活习惯、消费习惯等；
- *产品品行为（动态信息）*：产品类别、活跃频率、产品喜好、产品驱动、使用习惯、产品消费等；

## 数据源分析

构建用户画像是为了还原用户信息，因此数据来源于：所有用户相关的数据。

对用户相关数据的分类，所有的子分类的集合应该是该类空间的全集，如：佩戴眼镜的类型，一种是太阳镜，一种是光学镜；购买渠道分：线上渠道，线下渠道；眼镜什么周期，投入期、成长期、成熟期、衰退期……

必须是全集的原因为，有助于后续不断枚举并且迭代补充遗落的信息维度，不必担心架构上对每一层分类没有考虑完整，造成维度遗漏留下扩展性隐患。另外，不同的分类方式根据应用场景，业务需求的不同，也许各有道理，按需划分即可。

此处将用户数据划分为静态信息数据、动态信息数据两大类。

- 静态信息数据

用户相对稳定的信息，如图所示，主要包括人口属性、商业属性等方面数据。这类信息，自成标签，如果企业有真实信息则无需过多建模预测，更多的是数据清洗工作，因此这方面信息的数据建模不是本篇文章重点。

- 动态信息数据

用户在使用过程中，都会留下信息痕迹，后台就像上帝一样，会记录下这些信息，也就称为「日志」。比如在我们的系统中，浏览线上商城首页，浏览单品页，搜索无框眼镜，喜爱眼镜，试戴眼镜等行为，都会被记录在日志上，形成动态信息数据。在互联网上，用户的行为分析的来源就是这些动态信息。


## 数据调查

在调查分析数据的时候，无论来源是后台数据还是用户问卷调查，都需要探究研究的效度和信度论证，保证数据尽量准确可用。如果是问卷调查，需要做多少份问卷？换言之，就是我需要多大的样本才能准确地预估我的目标群体？这里参考GD Israel 等人发表的[Determining sample size](http://zulsidi.tripod.com/pdf/DeterminingSampleSizes.pdf) 和 Survey Monkey 的[规划样本大小](https://zh.surveymonkey.com/mp/sample-size/)。

### 确定目标群体

首先需要确定所要调查的群体，举例来说，如果你希望了解如何在北京地区在线推销魔兽款的眼镜，你的目标群体就是北京地区的网购群体；如果你尝试了解大学生中理想的眼镜款式，那目标对象就是大学生。

无论对象是国家范围还是当地区域，确定你想要调查的目标群体是非常重要的一步。知道目标群体后，就可以通过外部的资料，估算目标群体的人数组长。举例来说，根据[中国互联网络发展状况统计报告2015](https://cnnic.cn/gywm/xwzx/rdxw/2015/201601/W020160122639198410766.pdf)显示，北京地区上网人数大约为1600万。

因此，知道人数是多少了？这样我们就能进行下一步了…

### 你需要什么程度的准确性？

这个步骤的评估，是你愿意承担调查问卷结果可能出现的失准风险程度，所以你需要回答以下两个问题：

- 你需要答案反应目标群体看法的准确程度是多少？
这是你的误差范围，比如，60%的样本喜欢黑框眼镜，那么5%的误差范围则代表样本内有55-65%喜欢无框眼镜，一般来说5%是最常使用的误差范围，你可根据自己的调查问卷，设定1-10%的区间，但我们不建议你把范围调至超过10%；

- 你对样本能对目标群体进行采样的置信区间(Confidence Interval)是多少？
置信区间是对总体参数的真实值在测量值的区间所具有的可信程度，常见的计算方式如下：如果你从目标群体中随意挑选30多个样本，那么你在一个一个样本上所获得的结果和在其他30个样本上所获得的结果一样个概率是多少？如果置信区间为95%就表示你在95%的选择都会是一样的结果。95%的是最常用的置信区间，可调节的范围可以是90-99%，但不建议置信区间降到90%以下。

- 多大的样本数？
回到最初的问题，需要测多少的样本，在了解了目标对象、误差范围以及置信区间以后，查下面这个表格，就可以了解你需要多大的样本数了。

该表格数据为参考性指导，此外，如果人数超过100万人，你需要四舍五入到最接近的百位数。

- 有效问卷是多少？
很抱歉，不是每个人收到你的问卷后会填写，或者是会认真填写。
收到调查问卷后实际填写数量占发放数量的百分比为「回收率」，有效问卷占回收问卷的百分比为「有效率」，预估最后有效问卷，才能取得应该发放的问卷数量。

有效问卷的数量因很多因素而有显著差异，例如：与目标群体有关，问卷长度、复杂度、动机以及问卷主题等。如果是无关人的调查问卷，有效率能达到20-30%就是相当成功，如果之前从未对目标对象进行调查，10-15%就比较保守和安全。

- 那么，需要做多少份问卷？
在预估出步骤3的数字后除以步骤4的百分比，就是发放问卷的数量。
因此，举例来说，如果你需要1000个使用无框眼镜的大学生给你填写问卷，并且最后只有10%的有效率，那你就需要发放1万份问卷。

参考腾讯[2015年开放平台的白皮书](http://wiki.open.qq.com/wiki/%E8%85%BE%E8%AE%AF%E5%BC%80%E6%94%BE%E5%B9%B3%E5%8F%B0%E6%A6%82%E8%BF%B0)

要调查的眼镜属性与用户属性的交叉分析
- 不同眼镜材质的年龄性别分布

- 不同脸型的对不同镜架形状喜好程度

- 不同眼镜形状的年龄性别分布


# 具象的定性个体描述

to be continue...








